# TODO move to templates
MESSAGE_FOR_NOT_PAYED = '''Добрый день!

Вы активировали урок на сайте le-francais.ru — поэтому я направил Вам это письмо. Я описал там в двух словах положение дел, но если позволите, я хотел бы добавить несколько слов. Не сочтите за труд, прочтите мои объяснения. Здесь, кроме того, описаны важные моменты этого перехода.

Мы сделали платным доступ к урокам, начиная с 21-го. Я очень хочу, чтобы Вы отнеслись к этому с пониманием. Это было непростое решение, поверьте! Мы до последнего не хотели на это идти, хотя все вокруг нам настойчиво советовали поступить именно так. Мы держались, но обстоятельства просто выкрутили нам руки — и нам пришлось делать выбор: или мы бросаем проект, или мы сохраняем его и развиваем, но вот таким образом.

Бросить проект, в который вложено 12 лет любви и сумасшедшего труда и которым пользуются сотни человек (а всеми его сервисами и десятки тысяч)? У нас просто не поднялась рука.

Сделать платными уроки, которые для большинства учеников стали если и не частичкой их жизни, то привычным ее дополнением, которые они слушают уже не первый месяц, для учеников, которые по-настоящему мотивированы и извлекают из этого курса осязаемую пользу и ощутимо экономят — вот путь, который мы сочли справедливым и который выбрали.

Каковы причины, которые побудили нас решиться на этот шаг, я рассказал во всех подробностях на форуме: le-francais.ru/forum/raisons

Я надеюсь на то, что Вы поддержите проект и позволите ему развиваться. Это совсем небольшая жертва с вашей стороны, но она позволит сделать изучение французского еще легче, приятнее и удобнее — и для Вас, и для тех, кто пойдет следом за Вами. Это не просто плата за труд нескольких людей, это — вклад в общий проект, который помог вам и еще много раз поможет другим.

Это просто доброе дело.

Теперь по делу. 

Для пенсионеров и для тех, кто находится в очень стесненном финансовом положении, мы готовы предложить возможность оплачивать уроки по одному и со скидкой — по цене, как в абонементе на 50 уроков. И мы готовы предоставлять Вам билетики авансом под обещание их оплатить позже. И еще у нас действуют специальные условия для перемещенных лиц. Чтобы воспользоваться скидками и специальными условиями, напишите нам, любым способом подтвердите свой статус — мы внесем изменения в Ваш аккаунт.

И вот еще что! Система абонементов для активаций уроков — наследница виртуальных чашечек. Внутри системы они представлены одинаково: можно «чашечками» активировать «старшие» уроки и билетиками — «наливать» кофе.

Я еще хочу отдельно подчеркнуть (оказалось, это не для всех очевидно), что покупки на нашем сайте АБСОЛЮТНО БЕЗОПАСНЫ. Как и при любом другом онлайн-платеже (например, заказе авиабилетов или бронировании жилья), — во всех случаях оплаты картой через Интернет Вы вводите её реквизиты НЕ НА САЙТЕ ПРОДАВЦА, а через безопасное защищенное соединение НА САЙТЕ БАНКА. Все работает ровно так же, как при оплате картой в магазине: ее данные не остаются у продавца и недоступны ему — они передаются напрямую в банк. Кроме того, при онлайн-покупках все операции подтверждаются через SMS. Так что Вы надежно защищены. :)

Не хочу больше занимать Ваше внимание. Очень рассчитываю на Ваше понимание и готовность нас поддержать. Если Вы хотите чуть подробнее узнать, как все устроено в нашем проекте, почему мы вынуждены были пойти на этот шаг и какие у нас планы, я написал об этом на отдельной страничке на сайте: https://www.le-francais.ru/explication

Хорошего дня! Продолжайте учить французский с нами и получать удовольствие! :)

Илья Думов
le-francais.ru'''


# Obsolete
# MESSAGE_FOR_PAYED = '''Добрый день!
#
# Вы активировали урок на сайте le-francais.ru — поэтому я направил Вам это письмо. Я описал там в двух словах положение дел, но если позволите, я хотел бы добавить несколько слов. Не сочтите за труд, прочтите мои объяснения. Здесь, кроме того, описаны важные моменты этого перехода.
#
# Мы сделали платным доступ к последней части уроков «Для тех, кто хочет продолжать». Я очень хочу, чтобы Вы отнеслись к этому с пониманием. Это было непростое решение, поверьте! Мы до последнего не хотели на это идти, хотя все вокруг нам настойчиво советовали поступить именно так. Мы держались, но обстоятельства просто выкрутили нам руки — и нам пришлось делать выбор: или мы закрываем проект, или мы сохраняем его и развиваем, но вот таким образом.
#
# Закрыть проект, в который вложено десять лет любви и сумасшедшего труда и которым пользуются десятки тысяч человек? У нас просто не поднялась рука. Ах, если бы все были такими, как Вы, кто жертвовал в пользу проекта добровольно!
#
# Я надеюсь, что, как и прежде, Вы продолжите поддерживать проект. Это небольшая жертва с вашей стороны позволит сделать изучение французского еще легче, приятнее и удобнее — и для Вас, и для тех, кто пойдет следом за Вами. Это не просто плата за труд нескольких людей, это — вклад в общий проект, который помог вам и еще много раз поможет другим.
#
# Это просто доброе дело.
#
# Теперь по делу. Есть три важных пункта, которые я должен упомянуть.
#
# Первое. Чтобы как-то отметить Вас и отблагодарить за бескорыстную помощь, мы начислили Вам дополнительные пять «билетиков» в плюс к тем, которые у Вас уже есть.
#
# Второе. Если Вы пенсионер или студент, мы готовы предложить возможность оплачивать уроки по одному, но по цене, как в абонементе на 20 уроков. Чтобы перейти в такой режим, просто напишите нам и любым способом подтвердите свой статус — мы внесем изменения в аккаунт.
#
# Третье. Если Вы в течение последних пары лет переводили нам деньги без указания Вашего e-mail или указывали его, но зарегистрированы на сайте под другим — так, что мы не можем связать Ваш платеж с Вашим аккаунтом автоматически, — сообщите нам тоже, пожалуйста, сошлитесь на этот платеж — мы зачтем эту сумму по минимальной цене урока, каким бы ни был размер Вашего перевода.
#
# Чтобы нам написать, просто ответьте на это письмо.
#
# И вот еще что! Система абонементов для активаций уроков — наследница виртуальных чашечек. Внутри системы они представлены одинаково: можно «чашечками» активировать «старшие» уроки и билетиками — «наливать» кофе. И то, и то — суть одно и то же, просто называется по-разному. Так было сделано, чтобы соблюсти принцип бритвы Оккама: «Не следует множить сущее без необходимости». После первой активации Ваши чашечки превратятся в тыквы… pardon, в билетики. Это чтобы Вы понимали, как всё устроено.
#
# Я еще хочу отдельно подчеркнуть (оказалось, это не для всех очевидно), что покупки на нашем сайте АБСОЛЮТНО БЕЗОПАСНЫ. Как и при любом другом онлайн-платеже, Вы вводите реквизиты карты НЕ НА САЙТЕ ПРОДАВЦА, а через безопасное защищенное соединение НА САЙТЕ БАНКА. Все работает ровно так же, как при оплате картой в магазине: ее данные не остаются у продавца и недоступны ему — они передаются напрямую в банк. Кроме того, при онлайн-покупках все операции подтверждаются через SMS. Так что Вы надежно защищены. :)
#
# Не хочу больше занимать Ваше внимание. Очень рассчитываю на Ваше понимание и готовность нас поддержать. Если Вы хотите чуть подробнее узнать, как все устроено в нашем проекте, почему мы вынуждены были пойти на этот шаг и какие у нас планы, я написал об этом на отдельной страничке на сайте: https://www.le-francais.ru/explication
#
# Хорошего дня! Продолжайте учить французский с нами и получать удовольствие! :)
#
# Илья Думов
# le-francais.ru'''
